using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Algorithm
{
    internal class technology
    {
        /// Array[배열]
        /// 배열은 동일한 타입의 변수의 집합이다.
        /// 배열은 선언시 크기가 고정되며 배열의 값을 삭제하거나 크기를 변경할 수 없다.
        /// 배열은 선언시 크기만 지정하여 선언하거나 값을 지정해서 선언 할 수 있다.
        /// 배열은 선언시 힙영역에 동적으로 할당된 시작주소로부터 크기만큼 할당받는다.
        /// 배열은 힙영역에서 선언한 변수타입만큼 주소를 연속으로 할당 받기때문에 인덱스를 통해 쉽게 원하는 값을 찾을수 있다.
        
        /// List[리스트]
        /// 리스트는 선언시 힙영역에 일정크기만큼 배열과 같이 할당받는다
        /// 리스트는 배열과 다르게 값을 삭제하거나 크기 변경이 가능하다
        /// 리스트는 처음 설정된 크기를 초과하면 힙영역에 메모리를 계산하여 추가로 크기를 계산한 새배열을 만들고 거기에 원래 리스트의 값을 저장한 후 주소값을 변경한다
        /// 리스트에서 값을 삭제할때는 원래 리스트에 삭제할 데이터 다음 데이터들을 삭제할 인덱스 위치부터 저장하여 다시 저장한다
    }
}
